In [1]:
import sqlite3
import pandas as pd
import numpy as np

import matplotlib.pyplot as plt

In [29]:
# dbase = sqlite3.connect('Our_data.db')

In [30]:
# def insert_record(ID, NAME, DIVISION, STARS):
#     dbase.execute('''INSERT INTO employee_records VALUES (?,?,?,?)''', (ID, NAME, DIVISION, STARS))
#     dbase.commit()
# def read_data(table):
#     # can use dbase.execute but cursor is faster
#     cursor = dbase.cursor()
#     val = cursor.execute('''SELECT * FROM ''' + str(table))
#     x = val.fetchall()
# #     print(x)
#     for i in x:
#         print(i)
# #     for i in val:
# #         print("\n\nID \t\t: " + str(i[0]))
# #         print("Name \t\t: " + str(i[1]))
# #         print("Division \t: " + str(i[2]))
# #         print("Star \t\t: " + str(i[3]))
    
# #     for i in x:
# #         print("\n\nID \t\t: " + str(i[0]))
# #         print("Name \t\t: " + str(i[1]))
# #         print("Division \t: " + str(i[2]))
# #         print("Star \t\t: " + str(i[3]))

In [31]:
# dbase.execute('''CREATE TABLE IF NOT EXISTS employee_records (
#     ID INT PRIMARY KEY NOT NULL ,
#     Name TEXT NOT NULL ,
#     Division TEXT NOT NULL,
#     Star INT NOT NULL
# )''')

In [32]:
# insert_record(2, 'Karan', 'Mechanical', 4)

In [56]:
# insert_record(1, 'Aman', 'IT', 4)

In [58]:
# read_data('employee_records')

In [59]:
# dbase.close()

## Reading a csv file and inserting it into db

In [15]:
# data = pd.read_csv("train.csv")

In [14]:
# data.columns

In [13]:
# data.head()

In [12]:
# dbase.execute('''DROP table titanic''')

In [11]:
# dbase.execute('''CREATE TABLE IF NOT EXISTS titanic (
#     PassengerId INT PRIMARY KEY NOT NULL ,
#     Survived INT ,
#     Pclass INT,
#     Name TEXT ,
#     Sex TEXT ,
#     Age FLOAT,
#     SibSp INT, 
#     Parch INT,
#     Ticket TEXT ,
#     Fare FLOAT,
#     Cabin TEXT  ,
#     Embarked TEXT 
# )''')

In [68]:
# data.to_sql('titanic', dbase, if_exists='append', index=False)

In [69]:
# dbase.execute('''select * from titanic''')

In [70]:
# import csv
# cur = dbase.cursor()

In [71]:
# rows = csv.reader(data)

In [72]:
# rows

In [73]:
# cur.executemany("INSERT INTO titanic VALUES (?,?,?,?,?,?,?,?,?,?,?,?)", [rows] )

In [74]:
# cur.execute("SELECT * FROM titanic")
# print(cur.fetchall())

In [75]:
# read_data('titanic')

In [45]:
# import csv
# cur = dbase.cursor()
# rows = csv.reader(data)
# cur.executemany("INSERT INTO titanic VALUES (?,?,?,?,?,?,?,?,?,?,?,?)", [rows] )
# cur.execute("SELECT * FROM titanic")
# print(cur.fetchall())

## HELPER FUNCTION

In [8]:
def insert_record(table_name, values):
#     d = [(1,'Aman','8586096103', 'aman.r1298@gmail.com', 'aman'),(2, 'Karan', '1234567890', 'karan12@gmail.com', 'kiru')]
    if(table_name == 'retailer_data'):
        d = []
        for val in values:
            d.append((val))
    #     d = [(1),('Aman'),('8586096103'), ('aman.r1298@gmail.com'), ('aman')]

        print(d)

        dbase.executemany('''INSERT INTO ''' +str(table_name) + '''(r_name, r_ph_no, r_login_id, r_password) VALUES (?,?,?,?)''', d )
    #     dbase.execute('''INSERT INTO employee_records VALUES (?,?,?,?)''', (ID, NAME, DIVISION, STARS))
        dbase.commit()
    elif(table_name == 'customer_data'):
        d = []
        for val in values:
            d.append((val))
        print(d)
        dbase.executemany('''INSERT INTO ''' +str(table_name) + '''(c_name, c_ph_no, c_login_id, c_password) VALUES (?,?,?,?)''', d )
        dbase.commit()

# database schema

In [2]:
dbase = sqlite3.connect('Our_data.db')

## retailerData

In [10]:
dbase.execute('''create table if not exists retailer_data(
r_id integer primary key,
r_name  TEXT NOT_NULL,
r_ph_no TEXT,
r_login_id TEXT,
r_password TEXT
) ''')

In [11]:
#inserting values
l = [ ('aman', '8586096103', 'aman.r1298@gmail.com', 'aman1298'),('karan', '1234567890', 'karan@gmail.com', 'kiru1298'), ('Rohan', '9876543210', 'rohan@gmail.com', 'rohan123') ]
insert_record('retailer_data',l)
# l = [ 'karan', '1234567890', 'karan@gmail.com', 'kiru1298']
# insert_record('retailer_data', l)

[('aman', '8586096103', 'aman.r1298@gmail.com', 'aman1298'), ('karan', '1234567890', 'karan@gmail.com', 'kiru1298'), ('Rohan', '9876543210', 'rohan@gmail.com', 'rohan123')]

### view table

In [12]:
cur = dbase.cursor()
cur.execute('''select * from retailer_data''')
print(cur)
print(cur.fetchall())

<sqlite3.Cursor object at 0x7f445ba9d500>
[(1, 'aman', '8586096103', 'aman.r1298@gmail.com', 'aman1298'), (2, 'karan', '1234567890', 'karan@gmail.com', 'kiru1298'), (3, 'Rohan', '9876543210', 'rohan@gmail.com', 'rohan123')]

### For each retailer

### info_id_r_id

In [13]:
dbase.execute('''create table if not exists info_1(
product_id integer primary key,
product_name  TEXT NOT_NULL,
product_quantity INT,
product_cp FlOAT,
product_sp FLOAT
) ''')

In [ ]:
dbase.execute('''''')

### sales_id_r_id

In [14]:
dbase.execute('''create table if not exists sales_1 (
dt datetime default current_timestamp,
sales FLOAT
);''')

In [29]:
dbase.execute('''drop table sales_1''')

### transaction_id_r_id

In [3]:
# dbase.execute('''create table if not exists transactions_1(
# invoice_no NOT_NULL TEXT,
# description  TEXT,
# quantity int,
# invoice_date datetime default current_timestamp,
# price FLOAT,
# c_id  INT
# ); ''')

In [4]:
# dbase.execute('''create table if not exists transactions_1(
# invoice_no ,
# description ,
# quantity ,
# invoice_date ,
# price ,
# c_id
# ); ''')
# dbase.commit()

In [14]:
# import csv
# cur = dbase.cursor()
data  = pd.read_excel('../Apriori/Online Retail.xlsx')

In [15]:
len(data)

541909

In [8]:
len(data)train.csv

541909

In [16]:
# z = 0 
# for i in rows:
#     if( z == 10):
#         break
#     print(i)
#     z = z+1

# INSERTING DATA FROM CSV TO DB

In [9]:
data = pd.read_csv('../Apriori/online_retail_II.csv')

In [16]:
data.head()

,InvoiceNo,StockCode,lower,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,white hanging heart t-light holder,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom
1,536365,71053,white metal lantern,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
2,536365,84406B,cream cupid hearts coat hanger,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom
3,536365,84029G,knitted union flag hot water bottle,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
4,536365,84029E,red woolly hottie white heart.,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom

In [18]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541909 entries, 0 to 541908
Data columns (total 9 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    541909 non-null  object
 1   StockCode    541909 non-null  object
 2   lower        1816 non-null    object
 3   Description  540455 non-null  object
 4   Quantity     541909 non-null  int64
 5   InvoiceDate  541909 non-null  datetime64[ns]
 6   UnitPrice    541909 non-null  float64
 7   CustomerID   406829 non-null  float64
 8   Country      541909 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(1), object(5)
memory usage: 37.2+ MB

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1067371 entries, 0 to 1067370
Data columns (total 8 columns):
 #   Column       Non-Null Count    Dtype
---  ------       --------------    -----
 0   Invoice      1067371 non-null  object
 1   StockCode    1067371 non-null  object
 2   Description  1062989 non-null  object
 3   Quantity     1067371 non-null  int64
 4   InvoiceDate  1067371 non-null  object
 5   Price        1067371 non-null  float64
 6   Customer ID  824364 non-null   float64
 7   Country      1067371 non-null  object
dtypes: float64(2), int64(1), object(5)
memory usage: 65.1+ MB

In [19]:
len(data['StockCode'].unique())

4070

In [20]:
len(data['Description'].unique())

4224

In [21]:
dbase.execute('''drop table transactions_1''')

In [22]:
data.to_sql('transactions_1', dbase)

In [42]:
# rows = csv.reader(data)
# cur.executemany("INSERT INTO transactions_1 values (?,?,?,?,?,?)", [rows] )
# cur.execute("SELECT * FROM transactions_1")
# print(cur.fetchall())

In [18]:
# cur = dbase.cursor()
cur.execute('''select * from transactions_1''')
# print(cur)
print(cur.fetchall())

IOPub data rate exceeded.
The notebook server will temporarily stop sending output
to the client in order to avoid crashing it.
To change this limit, set the config variable
`--NotebookApp.iopub_data_rate_limit`.

Current values:
NotebookApp.iopub_data_rate_limit=1000000.0 (bytes/sec)
NotebookApp.rate_limit_window=3.0 (secs)

## Customer_data

In [19]:
dbase.execute('''create table if not exists customer_data(
c_id integer primary key,
c_name  TEXT NOT_NULL,
c_ph_no TEXT,
c_login_id TEXT,
c_password TEXT
) ''')

In [20]:
#inserting values
l = [ ('aman', '8586096103', 'aman.r1298@gmail.com', 'aman1298'),('karan', '1234567890', 'karan@gmail.com', 'kiru1298'), ('Rohan', '9876543210', 'rohan@gmail.com', 'rohan123') ]
insert_record('customer_data',l)

[('aman', '8586096103', 'aman.r1298@gmail.com', 'aman1298'), ('karan', '1234567890', 'karan@gmail.com', 'kiru1298'), ('Rohan', '9876543210', 'rohan@gmail.com', 'rohan123')]

In [21]:
# cur = dbase.cursor()
cur.execute('''select * from customer_data''')
print(cur)
print(cur.fetchall())

<sqlite3.Cursor object at 0x7f445ba9db20>
[(1, 'aman', '8586096103', 'aman.r1298@gmail.com', 'aman1298'), (2, 'karan', '1234567890', 'karan@gmail.com', 'kiru1298'), (3, 'Rohan', '9876543210', 'rohan@gmail.com', 'rohan123')]

## SALES DATA TO DB

In [30]:
sales_data = pd.read_csv('../Apriori/date_price_sales.csv')

In [31]:
sales_data.to_sql('sales_1', dbase, if_exists='append', index=False)

## SHOW ALL TABLES

In [22]:
cursor = dbase.cursor()
cursor.execute("SELECT name FROM sqlite_master WHERE type='table';")
print(cursor.fetchall())

[('retailer_data',), ('info_1',), ('sales_1',), ('transactions_1',), ('customer_data',)]

In [17]:
dbase.close()

## Creating shop_info

In [23]:
data.head()

,InvoiceNo,StockCode,lower,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,white hanging heart t-light holder,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom
1,536365,71053,white metal lantern,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
2,536365,84406B,cream cupid hearts coat hanger,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom
3,536365,84029G,knitted union flag hot water bottle,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
4,536365,84029E,red woolly hottie white heart.,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom

In [24]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541909 entries, 0 to 541908
Data columns (total 9 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    541909 non-null  object
 1   StockCode    541909 non-null  object
 2   lower        1816 non-null    object
 3   Description  540455 non-null  object
 4   Quantity     541909 non-null  int64
 5   InvoiceDate  541909 non-null  datetime64[ns]
 6   UnitPrice    541909 non-null  float64
 7   CustomerID   406829 non-null  float64
 8   Country      541909 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(1), object(5)
memory usage: 37.2+ MB

In [25]:
data.dropna(inplace=True)
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1442 entries, 0 to 1442
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   InvoiceNo    1442 non-null   object
 1   StockCode    1442 non-null   object
 2   lower        1442 non-null   object
 3   Description  1442 non-null   object
 4   Quantity     1442 non-null   int64
 5   InvoiceDate  1442 non-null   datetime64[ns]
 6   UnitPrice    1442 non-null   float64
 7   CustomerID   1442 non-null   float64
 8   Country      1442 non-null   object
dtypes: datetime64[ns](1), float64(2), int64(1), object(5)
memory usage: 112.7+ KB

In [26]:
len(data['StockCode'].unique())

776

In [27]:
len(data['Description'].unique())

777

In [29]:
shop = data[['StockCode','Description','UnitPrice']]

In [30]:
shop = shop.drop_duplicates(subset='StockCode')

In [31]:
shop.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 776 entries, 0 to 1438
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   StockCode    776 non-null    object
 1   Description  776 non-null    object
 2   UnitPrice    776 non-null    float64
dtypes: float64(1), object(2)
memory usage: 24.2+ KB

In [32]:
len(shop)

776

In [33]:
shop['Quantity'] = 300

In [58]:
shop.to_csv('../info_1.csv',index=False)

In [34]:
dbase.execute('''drop table info_1''')

In [35]:
shop.to_sql('info_1', dbase, if_exists='append', index=False)

In [20]:
import sqlite3
import time
import datetime
import random
import pandas as pd


df = pd.read_sql_query("SELECT * FROM customer_data", dbase)

# login_id = 'karn@gmail.com'
login_id = 'karan@gmail.com'
# password = 'kiru1298'
password = 'kiru128'
val = ''
val = df[df['c_login_id']==login_id]['c_password'][1]
print(type(val), len(val))
name = ""
if val == password: 
    name = df[df['c_password']==val]['c_name'][1]
    print('welcome',name)
else:
    print('wrong user name')
# else:
#     print('Wrong password')

<class 'str'> 8
wrong user name